import { Logger } from './core/Logger';

(function main() {
  const BUTTONSKEYBOARD = {
    mainMenu: [
      ['🔍 Подбор имени (по параметрам)', '🎲 Случайное имя'],
      ['📜 Списки имен', '💡 Значение имени'],
      ['❤️ Избранные имена', '⚙️ Настройки'],
    ],
    filters: [['👦 Мальчик', '👧 Девочка', '❔ Унисекс'], ['🇷🇺 Русские', '🇫🇷 Французские', '🇮🇳 Индийские'], ['⬅️ Назад']],
    randomName: [['✅ Принять', '🔁 Попросить другое'], ['❤️ Добавить в избранное'], ['⬅️ Назад']],
    nameLists: [['💎 Топ популярных имен', '🕊 Редкие и необычные'], ['📜 Классические и старинные', '🏛 Мифологические'], ['🎭 Литературные', '🔮 Значимые'], ['⬅️ Назад']],
    settings: [['📥 Экспорт избранных имен', '🔔 Уведомления'], ['🎨 Тема', '🌍 Язык интерфейса'], ['⬅️ Назад']],
  };
})();
